Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: This will catch problems that even the full test suite will not catch because it runs a subset of tests under miniperl rather than perl.
es: Eso detectará problemas que ni la batería de pruebas completa puede detectar, ya que ejecuta un subconjunto de las pruebas con miniperl, en lugar de perl.

source: This will either look like this:
es: Será algo así:

source: This will make creating a proper patch much simpler.
es: Esto facilitará la creación de parches.

source: This will match strings like "C<Oh say can you see by the dawn's early light>" and "C<Oh sit!>".
es: Esto detectará cadenas como "C<Asturias patria querida, Asturias de mis amores>" o "C<Astuto programadores>".

source: This will not work if you use C<require> instead of C<use>.
es: Pero no funcionará si usa C<require> en lugar de C<use>.

source: This will run basic sanity checks.
es: Esto realizará comprobaciones básicas.

source: This works exactly like calling C<< $file->save() >>.
es: Funciona exactamente igual que la llamada C<< $archivo->guardar() >>.

source: This works if the dereference produces a string I<or> a subroutine reference.
es: Esto funciona si la desreferencia produce una cadena I<o> una referencia a una subrutina.

source: This zero-width assertion evaluates any embedded Perl code.
es: Esta aserción de ancho cero evalúa código Perl incrustado.

source: This zero-width pattern can be used to mark the point reached in a string when a certain part of the pattern has been successfully matched.
es: Este patrón de ancho cero se puede utilizar para marcar el punto alcanzado en una cadena cuando se ha detectado una parte del patrón.

source: This zero-width pattern is similar to C<(*PRUNE)>, except that on failure it also signifies that whatever text that was matched leading up to the C<(*SKIP)> pattern being executed cannot be part of I<any> match of this pattern.
es: Este patrón de ancho cero es similar a C<(*PRUNE)> con la excepción de que, en caso de error de coincidencia, también significa que cualquier texto encontrado que active la ejecución del patrón C<(*SKIP)> no puede formar parte de I<ninguna> coincidencia de este patrón.

source: This zero-width pattern prunes the backtracking tree at the current point when backtracked into on failure.
es: Este patrón de ancho cero poda el árbol de vuelta atrás en el punto actual de vuelta atrás a causa de un error.

source: This:
es: La línea siguiente:

source: Those functions all have return values, so use them.
es: Estas funciones devuelven valores, por lo que debe usarlos.

source: Those older programs knew only about the ASCII character set, and so may not work properly for additional characters.
es: Esos programas antiguos solo usaban el juego de caracteres ASCII, por lo que es posible que no funcionen con otros caracteres.

source: Though forcing an argument into a particular form does not change the stored number, Perl remembers the result of such conversions.
es: Aunque forzar la conversión de un argumento a un formato específico no cambia el número almacenado, Perl recuerda el resultado de las conversiones.

source: Throughout Perl's documentation, you'll find numerous examples intended to help explain the discussed features.
es: En la documentación de Perl se incluyen muchos ejemplos que ilustran las características descritas.

source: Throughout the previous section all the examples have used the syntax:
es: En todos los ejemplos de la sección anterior se utilizó esta sintaxis:

source: Throughout this document you'll see references to other parts of the Perl documentation.
es: En este documento se incluyen referencias a otras partes de la documentación de Perl.

source: Thus
es: Por lo tanto

source: Thus ((),(),()) is equivalent to ().
es: Así que ((),(),()) es equivalente a ().

source: Thus C<$+{NAME_PAT}> would not be defined even though C<$+{NAME}> would be.
es: Así, C<$+{NOMBRE_PAT}> no estará definido a pesar de que C<$+{NOMBRE}> sí lo esté.

source: Thus C<(?-1)> refers to the most recently declared group, and C<(?+1)> indicates the next group to be declared.
es: Así, C<(?-1)> hace referencia al último grupo declarado y C<(?+1)> hace referencia al siguiente grupo que se va a declarar.

source: Thus Perl allows such constructs, by I<forcefully breaking the infinite loop>.
es: Perl permite estas construcciones I<forzando la interrupción del bucle infinito>.

source: Thus Perl provides the "possessive" quantifier form as well.
es: Por esta razón, Perl proporciona también el cuantificador "posesivo".

source: Thus arrays and hashes lose their identity in a LIST--the list
es: Así, los arrays y hashes pierden su identidad en una LISTA: la lista

source: Thus in the pattern
es: Así, en el patrón

source: Thus it breaks up characters into their UTF-8 bytes, so you may end up with malformed pieces of UTF-8.
es: Por lo tanto, descompone los caracteres UTF-8 en sus respectivos bytes, por lo que puede terminar con componentes UTF-8 incorrectos.

source: Thus the following will not match forever: X<\G>
es: Así, lo siguiente no coincidirá nunca: X<\G>

source: Thus the limits for Perl numbers stored as native integers would typically be -2**31..2**32-1, with appropriate modifications in the case of 64-bit integers.
es: Así, los límites para números Perl almacenados como enteros nativos serán normalmente -2**31..2**32-1, con las modificaciones correspondientes en el caso de los enteros de 64 bits.

source: Thus this modifier changes behavior only when the C<"/i"> modifier is also specified, and it turns out it affects only two characters, giving them full Unicode semantics: the C<MICRO SIGN> will match the Greek capital and small letters C<MU>, otherwise not; and the C<LATIN CAPITAL LETTER SHARP S> will match any of C<SS>, C<Ss>, C<sS>, and C<ss>, otherwise not.
es: Así, este modificador sólo cambia el comportamiento si también se especifica el modificador C<"/i">, y resulta que sólo afecta a dos caracteres, dándoles una semántica completa de Unicode: C<MICRO SIGN> coincidirá con las letras griegas C<MU> mayúscula y minúscula; de lo contrario, no. Y C<LATIN CAPITAL LETTER SHARP S> coincidirá con cualquiera de C<SS>, C<Ss>, C<sS>, y C<ss>; de lo contrario, no.

source: Thus zero-length matches alternate with one-character-long matches.
es: Así, las coincidencias de longitud cero se alternan con coincidencias de un carácter de longitud.

source: Thus,
es: Por lo tanto,

source: Thus, under this modifier, the ASCII platform effectively becomes a Unicode platform; and hence, for example, C<\w> will match any of the more than 100_000 word characters in Unicode.
es: Así, con este modificador la plataforma ASCII se convierte de forma efectiva en una plataforma Unicode. Por ejemplo, C<\w> detectará cualquiera de los más de 100 000 caracteres de Unicode que pueden formar parte de una "palabra".

source: Thus, for example, C<(?-p)> will warn when compiled under C<use warnings>; C<(?-d:...)> and C<(?dl:...)> are fatal errors.
es: Así, por ejemplo, C<(?-p)> mostrará una advertencia si se compila con C<use warnings>; C<(?-d:...)> y C<(?dl:...)> son errores irrecuperables.

source: Thus, the minimum offset is zero, not one, because you don't skip anything to get to the first item.
es: El desplazamiento mínimo es cero, no uno, ya que no hay que saltar nada para llegar al primer elemento.

source: Thus, this modifier doesn't mean you can't use Unicode, it means that to get Unicode matching you must explicitly use a construct (C<\p{}>, C<\P{}>) that signals Unicode.
es: Por lo tanto, este modificador no significa que no pueda utilizar Unicode, sino que para detectar coincidencias con Unicode hay que usar explícitamente una construcción (C<\p{}>, C<\P{}>) específica para Unicode.

source: Thus:
es: Por lo tanto:

source: Tidies a pod file.
es: Ordena un archivo pod.

source: Tim 5.004_01 1997-Jun-13 222 14 57 5.004_02 1997-Aug-07 112 16 119 5.004_03 1997-Sep-05 109 0 17 5.004_04 1997-Oct-15 66 8 173
es: Tim 5.004_01 1997-Jun-13 222 14 57 5.004_02 1997-Ago-07 112 16 119 5.004_03 1997-Sep-05 109 0 17 5.004_04 1997-Oct-15 66 8 173

source: To a computer scientist, it's a grammar for a little language in which some strings are legal and others aren't.
es: Para un informático, es una gramática de un minilenguaje en el que algunas cadenas son válidas y otras no.

source: To add one to something automatically, hence the name of the C<++> operator.
es: Sumar automáticamente una unidad de algo; por eso el operador correspondiente se llama C<++>.

source: To assign a specific L</network address> to a L</socket>.
es: Asignar una L</dirección de red> específica a un L</socket>.

source: To avoid any confusion, we nearly always use say "syscall" for something you could call indirectly via Perl's L<syscall|perlfunc/syscall> function, and never for something you would call with Perl's L<system|perlfunc/system> function.
es: Para evitar confusiones, casi siempre diremos "llamada de sistema" para referirnos a algo que se puede llamar indirectamente mediante la función L<syscall|perlfunc/syscall> de Perl; nunca lo usaremos para algo que se llame a través de la función L<system|perlfunc/system> de Perl.

source: To avoid stepping on each other's toes, they need to be sure to use different keys in the hash.
es: Para evitar conflictos, deben asegurarse de usar claves distintas en el hash.

source: To avoid this warning and to avoid having different output encodings in a single stream, always specify an encoding explicitly, for example with a PerlIO layer:
es: Para evitar esta advertencia y evitar la mezcla de distintas codificaciones de salida en una sola secuencia, especifique siempre una codificación explícitamente (por ejemplo, con una capa de entrada/salida):

source: To be universally understood, a Unix shell programmer must spend years of study in the art.
es: Un programador de shell Unix debe dedicar muchos años al estudio del oficio para lograr que todos le entiendan.

source: To break the loop, the following match after a zero-length match is prohibited to have a length of zero.
es: Para interrumpir el bucle, se prohíbe que tenga una longitud cero la siguiente coincidencia después de una coincidencia de longitud cero.

source: To commit to a maintenance version of perl, you need to create a local tracking branch:
es: Para confirmar en una versión de mantenimiento de perl debe crear una rama de seguimiento local:

source: To confuse the issue further, we use the word with two overloaded definitions: to describe how you can define your own L</subroutine> to hide a built-in L</function> of the same name (see L<perlsub/Overriding Built-in Functions>) and to describe how you can define a replacement L</method> in a L</derived class> to hide a L</base class>'s method of the same name (see L<perlobj>).
es: Para aumentar la confusión, usamos la palabra con dos definiciones sobrecargadas: describir cómo puede definir su propia L</subrutina> para ocultar una L</función> predefinida del mismo nombre (vea L<perlsub/Sobrescribir funciones predefinidas>) y describir cómo se puede definir un L</método> de sustitución en una L</clase derivada> para ocultar un método de la L</clase base> con el mismo nombre (vea L<perlobj>).

source: To create a child L</process> identical to the parent process at its moment of conception, at least until it gets ideas of its own.
es: Mecanismo que crea un L</proceso> derivado idéntico al proceso principal en el momento de su creación, al menos hasta que tenga sus propias ideas.

source: To deallocate the memory of a L</referent> (first triggering its C<DESTROY> method, if it has one).
es: Anular la asignación de memoria de un L</referente> (antes se desencadena su método C<DESTROY>, si lo tuviera).

source: To declare multiple parents, you simply need to pass multiple class names to C<use parent>:
es: Para declarar varias clases primarias basta con pasar varios nombres de clase a C<use parent>:

source: To decode, you have to know what encoding was used during the encoding phase.
es: Para descodificar necesita saber la codificación que se utilizó al codificar.

source: To delete a filter pass C<undef> to it.
es: Para eliminar un filtro debe pasarle C<undef>.

source: To determine if a module came with your version of Perl, you can install and use the L<Module::CoreList> module.
es: Para determinar si un módulo está incluido en su versión de Perl, puede usar L<Module::CoreList>.

source: To display and change the libnet configuration run the libnetcfg command.
es: Para mostrar y modificar la configuración de libnet, ejecute el comando libnetcfg.

source: To do this, instead compile the regular expression within the scope of C<use locale>.
es: Para ello debe compilar la expresión regular dentro del ámbito de C<use locale>.

source: To email a bug report, send it to bug-E<lt>distribution-nameE<gt>@rt.cpan.org . For example, if you wanted to report a bug in L<Business::ISBN>, you could send a message to bug-Business-ISBN@rt.cpan.org .
es: Para notificar un informe de error, envíe un mensaje de correo electrónico a L<bug-E<lt>nombre-distribuciónE<gt>@rt.cpan.org>. Por ejemplo, si desea notificar un error de L<Business::ISBN>, debe enviar un mensaje a L<bug-Business-ISBN@rt.cpan.org>.

source: To encode, you have to supply the target encoding, for example C<iso-8859-1> or C.
es: Al codificar debe especificar la codificación de destino (por ejemplo, C<iso-8859-1> o C).

source: To explain: David Croy once told me that at a previous job, there was one tape drive and multiple systems that used it for backups.
es: Esto merece una explicación: David Croy me contó que en un trabajo anterior tenían una unidad de cinta y varios sistemas que la usaban para realizar copias de seguridad.

source: To find out whether a given string is a valid non-zero number, it's sometimes enough to test it against both numeric 0 and also lexical "0" (although this will cause noises if warnings are on).
es: Para averiguar si una cadena determinada es un número válido distinto de cero, a veces basta con compararla con el 0 numérico y también con el "0" léxico (aunque esto provocará ruido si las advertencias están activadas).

source: To find out which character encodings your Perl supports, run:
es: Para averiguar cuáles son las codificaciones de caracteres admitidas por Perl, ejecute:

source: To find your local Perl Mongers (or PM as they're commonly abbreviated) group check the international Perl Mongers directory at L<http://www.pm.org/>.
es: Para localizar el grupo de Perl Mongers (o PM, como se acostumbra a abreviar) local o más cercano, consulte el directorio internacional de Perl Mongers en L<http://www.pm.org/>.

source: To fix by applying one, as it were.
es: Parchear consiste en aplicar un parche.

source: To forbid ASCII/non-ASCII matches (like "k" with C<\N{KELVIN SIGN}>), specify the "a" twice, for example C</aai> or C</aia>.
es: Para prohibir coincidencias ASCII/no-ASCII (como "k" con C<\N{KELVIN SIGN}>), especifique la "a" dos veces, por ejemplo C</aai> o C</aia>.

source: To gain access to symbols that are exported from another module.
es: Obtener acceso a símbolos exportados por otro módulo.

source: To get at hash elements:
es: Para obtener los elementos de un hash:

source: To get multiple values from an array:
es: Para obtener varios elementos de un array:

source: To have your event or group listed, contact brian d foy (brian@theperlreview.com).
es: Si desea incluir un evento o grupo en la lista, póngase en contacto con brian d foy (brian@theperlreview.com).

source: To help you convert legacy programs to Perl, we've included three conversion filters:
es: Los tres filtros de conversión siguientes generan código Perl:

source: To increase the value of something by 1 (or by some other number, if so specified).
es: Aumentar el valor de algo en una unidad (o en cualquier otra cantidad especificada).

source: To instead subtract one from something automatically is known as an "autodecrement".
es: Si en lugar de sumar se resta automáticamente una unidad de algo, la operación se llama "autodecrementar".

source: To learn how to install modules you download from CPAN, read L<perlmodinstall>.
es: Para aprender a instalar los módulos que descargue de CPAN, lea L<perlmodinstall>.

source: To learn how to use a particular module, use C<perldoc I<Module::Name>>.
es: Para aprender a usar un módulo específico, ejecute C<perldoc I<Nombre::Módulo>>.

source: To load on demand.
es: Carga que se realiza a petición.

source: To make a list reference that does I<NOT> interpolate, see L<perlref>.
es: Para crear una referencia de lista que I<NO> se interpole, vea L<perlref>.

source: To make a local branch of a remote branch:
es: Para crear una rama local de una rama remota:

source: To make symbols from a L</module> available for L</import> by other modules.
es: Hacer que los símbolos de un L</módulo> estén disponibles para L</importar> en otros módulos.

source: To match the actual end of the string and not ignore an optional trailing newline, use C<\z>.
es: Para coincidir con el final real de la cadena, sin omitir un posible carácter de fin de línea, use C<\z>.

source: To normal people, it's a pattern you can use to find what you're looking for when it varies from case to case.
es: Para las personas normales, es un patrón que se puede usar para encontrar lo que se busca cuando varía según el caso.

source: To parse this code, Perl uses a heuristic based on what package names it has seen, what subroutines exist in the current package, what barewords it has previously seen, and other input.
es: Para analizar este código, Perl usa una heurística basada en los nombres de paquete vistos, en las subrutinas existentes en el paquete actual, en las palabras sueltas usadas y en otros datos.

source: To read an entire L</file> into a L</string> in one operation.
es: (En inglés, I<slurp>). Leer un L</archivo> entero y asignar su contenido a una L</cadena> en una sola operación.

source: To read more about them check their respective manual pages at L<strict> and L<warnings>.
es: Para obtener más información, consulte las páginas de manual correspondientes a L<strict> y L<warnings>.

source: To read your private value, use the macro C<MRO_GET_PRIVATE_DATA()>, passing it the C<mro_meta> structure from the stash, and a pointer to your C<mro_alg> structure:
es: Para leer el valor privado, use la macro C<MRO_GET_PRIVATE_DATA()>, pasándole la estructura C<mro_meta> del hash de tabla de símbolos, y un puntero a la estructura C<mro_alg>:

source: To refer to the current contents of a group later on, within the same pattern, use C (or C<\g{1}>) for the first, C (or C<\g{2}>) for the second, and so on.
es: Para hacer referencia posteriormente, dentro del mismo patrón, al contenido actual de un grupo de captura, use C (o C<\g{1}>) para el primero, C (o C<\g{2}>) para el segundo, y así sucesivamente.

source: To reset your working directory to a pristine condition you can do:
es: Para limpiar el directorio de trabajo puede ejecutar el siguiente comando:

source: To run a L<program|/executable file> or L</subroutine>.
es: Ejecutar un L<programa|/archivo ejecutable> o una L</subrutina>.

source: To run a Perl program from the Unix command line:
es: Para ejecutar un programa Perl desde la línea de comandos de Unix, use el siguiente comando:

source: To see which sanity checks, have a look in F<t/porting>.
es: Si desea ver qué comprobaciones se van a realizar, consulte F<t/porting>.

source: To send a L</datagram> to multiple destinations simultaneously.
es: Enviar un L</datagrama> a varios destinos simultáneamente.

source: To send something to its correct destination.
es: Enviar algo a su destino correcto.

source: To set your private value, call C<Perl_mro_set_private_data()>:
es: Para establecer el valor privado, llame a C<Perl_mro_set_private_data()>:

source: To share files with the general public, dromedary serves your ~/public_html/ as C<http://users.perl5.git.perl.org/~yourlogin/>
es: Para compartir archivos con el público general, I<dromedary> ofrece ~/public_html/ como C<http://users.perl5.git.perl.org/~usuario/>

source: To simplify multi-line substitutions, the "." character never matches a newline unless you use the C</s> modifier, which in effect tells Perl to pretend the string is a single line--even if it isn't.
es: Para simplificar la sustitución de varias líneas, el carácter "." no coincide con un carácter de nueva línea a menos que utilice el modificador C</s>, que indica a Perl que suponga que la cadena es una sola línea, aunque no lo sea.

source: To split a string automatically, as the B<-a> L</switch> does when running under B<-p> or B<-n> in order to emulate L</awk>.
es: Operación que divide una cadena automáticamente, como el L</modificador> B<-a> cuando se ejecuta con B<-p> or B<-n> para emular a L</awk>.

source: To subtract a value from a variable, as in "decrement C<$x>" (meaning to remove 1 from its value) or "decrement C<$x> by 3".
es: Restar un valor de una variable, como en "decrementar C<$x>" (significa restar 1 de su valor) o "decrementar C<$x> en 3 unidades".

source: To summarise:
es: Su funcionamiento se puede resumir de la siguiente manera:

source: To summarize, this modifier provides protection for applications that don't wish to be exposed to all of Unicode.
es: En resumen, este modificador proporciona protección para aplicaciones que no se quieran exponer a todo el juego de caracteres Unicode.

source: To switch back to blead:
es: Para volver a blead:

source: To throw away the current L</process>'s program and replace it with another without exiting the process or relinquishing any resources held (apart from the old memory image).
es: Abandonar el programa del L</proceso> actual y reemplazarlo por otro sin salir del proceso ni renunciar a los recursos disponibles (salvo la imagen de memoria antigua).

source: To turn one string representation into another by mapping each character of the source string to its corresponding character in the result string.
es: Convertir una representación de cadena en otra mediante la asignación de cada carácter de la cadena de origen a su carácter correspondiente en la cadena resultante.

source: To use a here-document to assign an array, one line per element, you might use an approach like this:
es: Para usar un documento incrustado con el fin de asignar un array (una línea por elemento), puede hacer esto:

source: Today it is more common to use the quotemeta() function or the C<\Q> metaquoting escape sequence to disable all metacharacters' special meanings like this:
es: Actualmente es más común usar la función quotemeta() o la secuencia de escape C<\Q> para deshabilitar todos los significados especiales de los metacaracteres:

source: Tom 5.002b1g 1995-Dec-21 Doc release.
es: Tom 5.002b1g 1995-Dic-21 Publicación de doc.

source: Treat string as multiple lines.
es: Trata la cadena como si fuera un conjunto de líneas.

source: Treat string as single line.
es: Trata la cadena como una sola línea.

source: Treats the return value of the code block as the condition.
es: Trata el valor devuelto como la condición del bloque de código.

source: Tricky, eh?
es: Es un poco lioso, ¿no?

source: Try C<perl -MFoo -e 1>.
es: Ejecute C<perl -MFoo -e 1>

source: Try "/hurd/pfinet --help" for more information.
es: Pruebe "/hurd/pfinet --help" para obtener más información.

source: Try to document your code and use Pod formatting in a consistent way.
es: Procure documentar el código y usar el formato Pod de una manera coherente.
